In [39]:
import pandas as pd
import numpy as np

In [2]:
from sqlalchemy import create_engine

In [3]:
engine = create_engine('postgresql://root:root@localhost:5432/ny_taxi')

In [4]:
engine.connect()

In [49]:
query = """
SELECT count(*) from green_trip_data
where DATE(lpep_pickup_datetime) >= DATE '2019-09-18'
    AND DATE(lpep_pickup_datetime) < DATE '2019-09-19'
    AND DATE(lpep_dropoff_datetime) >= DATE '2019-09-18'
    AND DATE(lpep_dropoff_datetime) < DATE '2019-09-19'
"""
pd.read_sql(query, con=engine)

   count
0  15612

In [91]:
query = """
SELECT zones."Borough", Sum(total_amount) as sum_total_amount
FROM (
    SELECT * from green_trip_data
    WHERE DATE(lpep_pickup_datetime) = DATE '2019-09-18'
) as a
INNER JOIN zones
ON a."PULocationID" = zones."LocationID"
GROUP BY zones."Borough"
ORDER BY sum_total_amount DESC
"""
pd.read_sql(query, con=engine)

         Borough  sum_total_amount
0       Brooklyn          96333.24
1      Manhattan          92271.30
2         Queens          78671.71
3          Bronx          32830.09
4        Unknown            728.75
5  Staten Island            342.59

In [92]:
query = """
    select * from zones where zones."Zone" = 'Astoria'
"""
pd.read_sql(query, con=engine)

   index  LocationID Borough     Zone service_zone
0      6           7  Queens  Astoria    Boro Zone

In [95]:
query = """
SELECT zones."Zone" as drop_zone, tip_amount
FROM (
    SELECT * from green_trip_data
    WHERE DATE(lpep_pickup_datetime) >= DATE '2019-09-01'
    AND DATE(lpep_pickup_datetime) < DATE '2019-10-01'
    AND green_trip_data."PULocationID" = 7
) as a
INNER JOIN zones
ON a."DOLocationID" = zones."LocationID"
ORDER BY tip_amount DESC
LIMIT 100
"""
pd.read_sql(query, con=engine)

                drop_zone  tip_amount
0             JFK Airport       62.31
1                Woodside       30.00
2                Kips Bay       28.00
3                      NV       25.00
4   Upper West Side South       20.00
..                    ...         ...
95       Hamilton Heights        8.68
96                   SoHo        8.67
97        Windsor Terrace        8.66
98             Park Slope        8.58
99               Union Sq        8.51

[100 rows x 2 columns]